In [3]:
import numpy as np
import pandas as pd

In [7]:
d = { 'A': [1,2,np.nan], 'B': [5,np.nan,np.nan], 'C': [1,2,3]}

In [9]:
df = pd.DataFrame(d)

In [11]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [19]:
df.dropna(axis=1) # columns

   C
0  1
1  2
2  3

In [17]:
df.dropna() #default axis=0 (rows)

     A    B  C
0  1.0  5.0  1

In [25]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [29]:
df # inplace=True to commit changes

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [31]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [39]:
df['A'].fillna(value=df['A'].mean()) 
# This is highly relevant to various statistical methods for backfilling data depending on the data type. 
# Most numeric operations are supported.

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64